DROP TABLE IF EXISTS activity;
DROP TABLE IF EXISTS mass; 
DROP TABLE IF EXISTS users;


CREATE TABLE activity
(
	id INT NOT NULL AUTO_INCREMENT,
	name VARCHAR(255),
	time VARCHAR(255),
	position VARCHAR(255),
	mass VARCHAR(255),
	slogan VARCHAR(255),
	remarks VARCHAR(255),
	PRIMARY KEY (id) 
);

CREATE TABLE mass
(
	id INT NOT NULL AUTO_INCREMENT,
	name VARCHAR(255),
	time VARCHAR(255),
	principal VARCHAR(255),
	telephone VARCHAR(255),
	email VARCHAR(255),
	members VARCHAR(1024),
	activities VARCHAR(1024),
	introduction VARCHAR(1024),
	PRIMARY KEY (id)
);

CREATE TABLE users
(
	id INT NOT NULL AUTO_INCREMENT,
	name VARCHAR(255),
	college VARCHAR(255),
	class VARCHAR(255),
	PRIMARY KEY (id)
);

INSERT INTO activity
(name,time,position,mass,slogan,remarks)
VALUES 
("你的月亮我的心","2015.12.2","校舞臺","话剧社、文学社","由文學社與話劇社共同創作","參演者：陈刚、杨怡伶、林亚蓉、李家伟"),
("星座書上","2016.08.11","校舞臺","话剧社","一場星座的漫談","參演者：郭育维、吴兰木"),
("心裏健康講座","2015.02.5","一教學樓102","心理协会","心理健康,關乎你我他","演講人：苏思翰"),
("詩歌朗誦大賽","2015.07.11","一教學樓204","文学社","一首將進酒，勸君杯莫停","獲奬名單：楊信宏、葉忠翰、林子竹"),
("升龍拳教學","2016.08.9","操場","散打社","人人可街霸"," "),
("小提琴演奏","2015.11.5","音樂廳","音乐协会","讓音樂升華你的心靈"," "),
("乒乓球校内賽","2017.01.6","體育館","乒乓社","下一個乒乓小將就决定是你了","獲奬名單：許育海、史怡靜、蘇思翰"),
("cosplay舞會","2016.06.14","操場","动漫社","快來和雄大熊二跳個舞吧"," "),
("街頭籃球表演","2015.09.13","體育館","街舞社、篮球社","籃球原來也可以這樣打"," "),
("鬼步教學","2016.04.11","操場","街舞社","摩擦摩擦，是魔鬼的步伐"," "),
("愛心捐款","2015.03.13","食堂","志愿者协会","一點一滴也是獻愛心"," "),
("山區支教","2016.02.19","食堂","志愿者协会","爲孩子們點亮知識的燈塔"," ");


INSERT INTO mass 
(name,time,principal,telephone,email,members,activities,introduction) 
VALUES 
("话剧社","2015.06.12","陈刚","13910241926","1861191685@qq.com","陈刚、杨怡伶、林亚蓉、李家伟、陈皓茜、杨郁婷、张旺茹、李彦志、张雅玫、郭育维、吴兰木、江松兰","你的月亮我的心、星座书上","二师兄说，再不来话剧社，师傅就被抓走了!!"),
("心理协会","2014.07.05","陈强","13910247562","1833187760@qq.com","陈强、吴淑霞、许育海、赖雅婷、谢宜恩、储世昌、张雅泰、周左达、林馨仪、史怡静、苏思翰、赵美绍","心里健康讲座","接过你的手，我们就是知己了"),
("文学社","2014.08.14","陈伟","13910241968","1823794154@qq.com","陈伟、黄崇舜、杨季生、陈一柏、杨信宏、叶忠翰、林子竹、黄千倩、蔡冠宇、张玉萍、丁宜芳","你的月亮我的心、诗歌朗诵大赛","cinderella的眼泪，需要你的谱写语话"),
("散打社","2016.02.11","郭英","13910245722","2010951991@qq.com","郭英、谢伟元、林婉婷、刘冠良、侯盈如、王薇宣、臧杰良","升龙拳教学","能抗击打的来，不能抗击打的更要来!!"),
("音乐协会","2015.04.05","姜明","13910249526","364382209@qq.com","姜明、谢伟元、陈雅惠、叶依婷、黄美惠、赖雅娇","小提琴演奏","在我的歌声里，梦一场新不了情!!"),
("乒乓社","2016.05.01","姜涛","13910246124","805998357@qq.com","姜涛、吴淑霞、许育海、赖雅婷、史怡静、苏思翰、赵美绍","乒乓球校内赛","国粹，还有什么理由不来"),
("动漫社","2016.02.01","李刚","13910248423","465712409@qq.com","李刚、谢宜恩、储世昌、张雅泰、周左达、林馨仪","cosplay舞会","立志要成为像海贼王一样的男人"),
("篮球社","2013.02.03","李军","13910247159","1147500379@qq.com","李军、林子竹、黄千倩、蔡冠宇、张玉萍、丁宜芳","街头篮球表演","少年强，则中国强"),
("街舞社","2015.09.11","李强","13910240430","1430299597@qq.com","李强、黄崇舜、杨季生、陈一柏、杨信宏、叶忠翰","街头篮球表演、鬼步教学","舞动青春，没你不行"),
("志愿者协会","2013.11.02","李铁","13910246141","1839285934@qq.com","李铁、杨怡伶、林亚蓉、李家伟、陈皓茜、杨郁婷、张旺茹、李彦志、张雅玫、郭育维","爱心捐款、山区支教","无私奉献，在我的眼，你的心。。");


INSERT INTO users 
(name,college,class) 
VALUES 
("陈刚","软件学院","1604"),
("杨怡伶","软件学院","1604"),
("林亚蓉","软件学院","1604"),
("李家伟","软件学院","1604"),
("陈皓茜","软件学院","1604"),
("杨郁婷","软件学院","1604"),
("张旺茹","软件学院","1604"),
("李彦志","软件学院","1604"),
("张雅玫","软件学院","1604"),
("郭育维","软件学院","1604"),
("吴兰木","软件学院","1604"),
("江松兰","软件学院","1604"),
("陈强","软件学院","1604"),
("吴淑霞","软件学院","1604"),
("许育海","软件学院","1604"),
("赖雅婷","软件学院","1604"),
("谢宜恩","软件学院","1604"),
("储世昌","软件学院","1604"),
("张雅泰","软件学院","1604"),
("周左达","软件学院","1604"),
("林馨仪","软件学院","1604"),
("史怡静","软件学院","1604"),
("苏思翰","软件学院","1604"),
("赵美绍","软件学院","1604"),
("陈伟","软件学院","1604"),
("黄崇舜","软件学院","1604"),
("杨季生","软件学院","1604"),
("陈一柏","软件学院","1604"),
("杨信宏","软件学院","1604"),
("叶忠翰","软件学院","1604"),
("林子竹","软件学院","1604"),
("黄千倩","软件学院","1604"),
("蔡冠宇","软件学院","1604"),
("张玉萍","软件学院","1604"),
("丁宜芳","软件学院","1604"),
("郭英","软件学院","1604"),
("谢伟元","软件学院","1604"),
("林婉婷","软件学院","1604"),
("刘冠良","软件学院","1604"),
("侯盈如","软件学院","1604"),
("王薇宣","软件学院","1604"),
("臧杰良","软件学院","1604"),
("姜明","软件学院","1604"),
("陈雅惠","软件学院","1604"),
("叶依婷","软件学院","1604"),
("黄美惠","软件学院","1604"),
("赖雅娇","软件学院","1604"),
("姜涛","软件学院","1604"),
("李刚","软件学院","1604"),
("李军","软件学院","1604"),
("李强","软件学院","1604"),
("李铁","软件学院","1604");
